
function Task() {

    return (
      <div>

        <div>Задача: 
            <ol>
                <li>На странице есть инпут, реализовать поиск продуктов по введенному значению. Информация в <code>api.ts</code></li>
                <li>Сделать так, чтобы поиск работал не на каждое нажатие кнопки в инпуте, а после того, как пользователь закончит ввод</li>
            </ol>
        </div>

        <details>
          <summary>Спойлер: должен получиться результат, похожий на этот</summary>
          <img src="https://i.ibb.co/9cQ9cbz/2023-11-17-11-28-15.png" alt="" />
        </details>
        <br />
        <hr />
      </div>
    )
  }
  
  export default Task
  